Revit 2024 API
UnitTypeId.CelsiusInterval Property
 Celsius interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CelsiusInterval { get; }
Visual Basic
Public Shared ReadOnly Property CelsiusInterval As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CelsiusInterval {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace